import './style.scss'


function Main() {


    return (
        <div className="main-container">

            <div className="razrab">
                <h2>Разработка смарт-контрактов</h2>
                <p>Разрабатываем смарт-контракты для автоматизации бизнес-процессов и повышения доверия к транзакциям</p>
            </div>

            <div className='smart-contarct-key'>

                <div className='left'>
                    <h2>Смарт-контракты — ключ к автоматизации</h2>
                    <p>Смарт-контракты — это автоматизированные цифровые контракты, которые позволяют формулировать высокозащищенные и самоисполняющиеся соглашения. </p>
                    <p>Они являются сердцем любого приложения или экосистемы на основе блокчейна. Смарт-контракты — основа автоматизации всего процесса разработки блокчейна. </p>
                </div>

                <div className="right">
                    <p>Доверьте создание смарт-контрактов экспертам, чтобы получить следующие результаты: </p>
                    <ul>
                        <li>автоматизация процессов, операций и соглашений;</li>
                        <li>замена ненадежной бумажной документации;</li>
                        <li>сокращение бюрократии;</li>
                        <li>прозрачность и безопасность нового уровня. </li>
                    </ul>
                    <p>Несмотря на растущую популярность, разработка смарт-контрактов по-прежнему остается загадкой для многих компаний и разработчиков, во многом из-за природы и особенностей смарт-контрактов.</p>
                    <p>Мы же всегда остаемся в курсе всех технологий и инноваций в мире блокчейна, и наша команда экспертов сосредоточена на создании современных и сбалансированных смарт-контрактов.</p>
                </div>
            </div>


            <div className="why-smart">
                <h2>Зачем бизнесу смарт-контракты </h2>

                <div className="why-inner">

                    <div className="left">

                        <div className="block">

                            <div className="zag">
                                <img src="why-contract/avtomatization.svg" alt="avto" />
                                <p>Автоматизация</p>
                            </div>

                            <h3>Автоматизация</h3>

                            <p>Ключ к автоматизации процессов, транзакций и соглашений.</p>
                        </div>

                        <div className="block">

                            <div className="zag">
                                <img src="why-contract/cash.svg" alt="avto" />
                                <p>Снижение затрат</p>
                            </div>

                            <h3>Снижение затрат</h3>

                            <p>За счет сокращения объема бумажной работы и отсутствия третьей стороны </p>
                        </div>

                        <div className="block">

                            <div className="zag">
                                <img src="why-contract/lock.svg" alt="avto" />
                                <p>Улучшение безопасности</p>
                            </div>

                            <h3>Улучшение безопасности</h3>

                            <p>Децентрализованное управление снижает риск манипуляций </p>
                        </div>
                    </div>

                    <div className="right">
                        <div className="block">

                            <div className="zag">
                                <img src="why-contract/nocash.svg" alt="avto" />
                                <p>Отсутствие бумажной волокиты</p>
                            </div>

                            <h3>Отсутствие бумажной волокиты</h3>

                            <p>Все задачи больше не выполняются вручную </p>
                        </div>

                        <div className="block">

                            <div className="zag">
                                <img src="why-contract/noman.svg" alt="avto" />
                                <p>Отсутствие посредников</p>
                            </div>

                            <h3>Отсутствие посредников</h3>

                            <p>Смарт-контракты не зависят от третьей стороны</p>
                        </div>
                    </div>
                </div>
            </div>



            <div className="whyWeDoing">

                <div className="left">
                    <h2>Что мы предлагаем</h2>

                    <div className="texts">
                        <h3>Проектирование архитектуры смарт-контрактов </h3>
                        <p>Прежде чем перейти к написанию кода, мы описываем базовый архитектурный проект, который определяет бизнес-логику и содержит функциональное описание смарт-контрактов. </p>
                    </div>

                    <div className="texts">
                        <h3>Разработка смарт-контрактов </h3>
                        <p>Проектируем и создаем кастомизированные, продуманные и тщательно протестированные смарт-контракты с функциями, адаптируемыми к целому ряду отраслей промышленности.</p>
                    </div>

                    <div className="texts">
                        <h3>Оптимизация смарт-контрактов </h3>
                        <p>Выявляем уязвимости и предлагаем решения для оптимизации и повышения эффективности смарт-контрактов.</p>
                    </div>

                    <div className="texts">
                        <h3>Аудит смарт-контрактов</h3>
                        <p>Используем наш опыт в разработке, чтобы провести оценку ваших смарт-контрактов и устранить ошибки.</p>
                    </div>
                </div>


                <div className="right">

                    <div className="texts">
                        <h3>Менеджмент смарт-контрактов </h3>
                        <p>Не только создаем, но и управляем жизненным циклом смарт-контрактов, начиная с переговоров и заканчивая мониторингом и проверкой соблюдения договорных обязательств. </p>
                    </div>

                    <div className="texts">
                        <h3>Интеграция смарт-контрактов </h3>
                        <p>Интегрируем смарт-контракты с внешними системами и устройствами для автоматической проверки и выполнения транзакций. </p>
                    </div>

                    <div className="texts">
                        <h3>Смарт-контракты для dApp</h3>
                        <p>Разрабатываем dApps с использованием смарт-контрактов, которые легко достигают бизнес-целей и эффективно решают сложные операционные задачи.</p>
                    </div>

                    <div className="texts">
                        <h3>Смарт-контракты для DEX</h3>
                        <p>Разрабатываем смарт-контракты для децентрализованных бирж.</p>
                    </div>

                    <div className="texts">
                        <h3>Смарт-контракты для Digital Wallets </h3>
                        <p>Разрабатываем смарт-контракты для цифровых кошельков для совершения надежных и быстрых транзакций без участия третьих лиц. </p>
                    </div>
                </div>
            </div>

            <div className="howWeWork">
                <h4>Как мы работаем</h4>

                <div className="steps">

                    <div className="step">
                        <div>
                            <h3>01</h3>
                            <p className='line'></p>
                            <img src="why-contract/arrow.svg" alt="arrow" />
                        </div>
                        <h2>Анализ требований</h2>
                        <p>Знакомимся, анализируем бизнес-логику, оцениваем проблему и разрабатываем roadmap.</p>
                    </div>

                    <div className="step">
                        <div>
                            <h3>02</h3>
                            <p className='line'></p>
                            <img src="why-contract/arrow.svg" alt="arrow" />
                        </div>
                        <h2>Подготовка проекта и дизайн</h2>
                        <p>Разрабатываем структуру и дизайн проекта, проектируем смарт-контракты.</p>
                    </div>

                    <div className="step">
                        <div>
                            <h3>03</h3>
                            <p className='line'></p>
                            <img src="why-contract/arrow.svg" alt="arrow" />
                        </div>
                        <h2>Разработка</h2>
                        <p>Пишем код смарт-контрактов, оформляем дизайн и архитектуру, собираем обратную связь.</p>
                    </div>

                    <div className="step">
                        <div>
                            <h3>04</h3>
                            <p className='line'></p>
                            <img src="why-contract/arrow.svg" alt="arrow" />
                        </div>
                        <h2>Развертывание и тестирование</h2>
                        <p>Развертываем смарт-контракты в testnet, а затем в mainnet.</p>
                    </div>

                    <div className="step">
                        <div>
                            <h3>05</h3>
                        </div>
                        <h2>Анализ результатов и отчетность</h2>
                    </div>
                </div>
            </div>


            <div className="technology">
                <h2>Технологии и инструменты, которые мы используем</h2>
                <div>
                    <ul>
                        <li>Ethereum</li>
                        <li>Hyperledger Iroha</li>
                        <li>Solidity</li>
                    </ul>
                    <ul>
                        <li>Credits</li>
                        <li>MultiChain</li>
                        <li>Hyperledger Burrow</li>
                    </ul>
                    <ul>
                        <li>Hyperledger Sawtooth</li>
                        <li>Corda</li>
                        <li>NEM</li>
                    </ul>
                    <ul>
                        <li>Hyperledger Fabric</li>
                        <li>EOS</li>
                        <li>BigchainDB</li>
                        <li>Hedera</li>
                    </ul>
                </div>

                <div className='black-outer'>
                    <div className="black">
                        <h3>5 причин выбрать нашу команду</h3>
                        <div className="right">
                            <ul>
                                <li>Специализируемся на разработке смарт-контрактов </li>
                                <li>Проводим тщательные исследования </li>
                                <li>Оказываем поддержку и занимаемся техническим обслуживанием </li>
                                <li>Собственная кроссфункциональная команда блокчейн-специалистов</li>
                                <li>Наглядное портфолио </li>
                            </ul>

                            <a href="https://cbd.minjust.gov.kg/112346/edition/1220896/ru" target='_blank'>Проконсультироваться</a>
                        </div>
                    </div>
                </div>
            </div>

        </div>
    )
}


export { Main }